# ==================================================
#
#   Lection 11.
#   поиск наибольшей общей подпоследовательности среди двух списков.
#
#   asymptotics: O(N*M)
#
# ==================================================

""" """
""" 
    
"""
def lcs(A, B):
    F = [[0] * (len(B)+1) for i in range(len(A)+1)]

    for i in range(1, len(A)):
        for j in range(1, len(B)):
            if A[i-1] == B[j-1]:
                F[i][j] = F[i-1][j-1] + 1
            else:
                F[i][j] = max(F[i-1][j], F[i][j-1])

    return F[-1][-1]







A = [1, 4, 2, 3, 6, 5, 8, 9, 10]
B = [1, 2, 4, 5, 6, 7, 8]

print(lcs(A, B))